Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreatePart(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pP1:
pPart:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByParts(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
Part1Id:
Part2Id:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@)
DO NOT USE! For internal usage only!
Part1Id:
Part2Id:
pFace1:
pFace2:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBentPlateRadius(System.Int32,System.Int32,System.Double)
DO NOT USE! For internal usage only!
PartId:
GeometryNodeId:
Radius:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBoltGroup(Tekla.Structures.ModelInternal.dotBoltShapeData_t@,Tekla.Structures.ModelInternal.dotBoltGroup_t@)
DO NOT USE! For internal usage only!
pBoltShapeData:
pBoltGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@)
DO NOT USE! For internal usage only!
pTreatment:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCalculateContourPolygon(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPolygon_t@)
DO NOT USE! For internal usage only!
pContour:
pPolygon:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPart(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pP1:
pPart:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectBoltGroup(Tekla.Structures.ModelInternal.dotBoltShapeData_t@,Tekla.Structures.ModelInternal.dotBoltGroup_t@)
DO NOT USE! For internal usage only!
pBoltShapeData:
pBoltGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@)
DO NOT USE! For internal usage only!
pTreatment:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyPart(Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pP1:
pPart:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBoltGroup(Tekla.Structures.ModelInternal.dotBoltShapeData_t@,Tekla.Structures.ModelInternal.dotBoltGroup_t@)
DO NOT USE! For internal usage only!
pBoltShapeData:
pBoltGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifySurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@)
DO NOT USE! For internal usage only!
pTreatment:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDisplayPrompt(System.String)
DO NOT USE! For internal usage only!
Message:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.EditMacro(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.StartMacroRecording(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.IsMacroRecording
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.StopMacroRecording
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.RefreshMacroList
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportInsertView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetStringPropertyFromDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)
pProperty:
stringValues:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetStringPropertyToDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)
pProperty:
stringValues:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSnapshotFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t@,System.Boolean)
Enumerator:
SelectInstances:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)
dotSolid:
serializedFaceList:
serializedVectorList:
serializedShellIndexList:
serializedFaceOriginIdList:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRebarSetFunction(Tekla.Structures.ModelInternal.RebarSetAction,Tekla.Structures.ModelInternal.dotRebarSet_t@)
DO NOT USE! For internal usage only!
action:
pRebarSet:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRebarSetAdditionFunction(Tekla.Structures.ModelInternal.RebarSetAction,Tekla.Structures.ModelInternal.dotRebarSetAddition_t@)
DO NOT USE! For internal usage only!
action:
pRebarSetAddition:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateLegFace(Tekla.Structures.ModelInternal.dotLegFace_t@)
DO NOT USE! For internal usage only!
pLegFace:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectLegFace(Tekla.Structures.ModelInternal.dotLegFace_t@)
DO NOT USE! For internal usage only!
pLegFace:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateGuideline(Tekla.Structures.ModelInternal.dotGuideline_t@)
DO NOT USE! For internal usage only!
pGuideline:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectGuideline(Tekla.Structures.ModelInternal.dotGuideline_t@)
DO NOT USE! For internal usage only!
pGuideline:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only!
pStrip:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSurfaceObject(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectSurfaceObject(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifySurfaceObject(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject:
Returns: